<h1 style="text-align: center", ;"> <font color=#FFFFF size=5> Tratamento e Manipulação de Dados - Desafios </font> </h1>

In [82]:
import pandas as pd
import numpy as np

In [83]:
# Projeto 1: Vendas Online
dados_vendas = pd.read_json('./data/dados_vendas_clientes.json')
dados_vendas = pd.json_normalize(dados_vendas['dados_vendas'])

# Projeto 2: Locação Imovéis
dados_imoveis = pd.read_json('./data/dados_locacao_imoveis.json')
dados_imoveis = pd.json_normalize(dados_imoveis['dados_locacao'])

In [84]:
dados_vendas

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","[R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]"
1,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","[R$ 825,31, R$ 168,07, R$ 339,18, R$ 314,69]"
2,08/06/2022,"[Isabely JOanes 738, JOãO Gabriel 671, Julya m...","[R$ 682,05, R$ 386,34, R$ 622,65, R$ 630,79]"
3,09/06/2022,"[Julya meireles 914, MaRIA Julia 444, MaRIA Ju...","[R$ 390,3, R$ 759,16, R$ 334,47, R$ 678,78]"
4,10/06/2022,"[MaRIA Julia 444, PEDRO PASCO 812, Paulo castr...","[R$ 314,24, R$ 311,15, R$ 899,16, R$ 885,24]"

In [85]:
# Remover os dados em listas
dados_vendas = dados_vendas.explode(column=['Cliente', 'Valor da compra']).reset_index(drop=True)
dados_imoveis = dados_imoveis.explode(column=list(dados_imoveis.columns[1:])).reset_index(drop=True)

In [86]:
dados_vendas['Valor da compra'] = dados_vendas['Valor da compra'].apply(
    lambda x : x.replace('R$', '').replace(',', '.').strip()
)   
dados_imoveis['valor_aluguel'] = dados_imoveis['valor_aluguel'].str.replace('$ ', '').str.replace(',', '.').str.replace(' reais', '').str.strip()

In [87]:
dados_vendas['Valor da compra'] = dados_vendas['Valor da compra'].astype(np.float64)
dados_imoveis['valor_aluguel'] = dados_imoveis['valor_aluguel'].astype(np.float64)

In [88]:
dados_vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: float64(1), object(2)
memory usage: 612.0+ bytes

In [89]:
dados_imoveis.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   apartamento                 30 non-null     object
 1   datas_combinadas_pagamento  30 non-null     object
 2   datas_de_pagamento          30 non-null     object
 3   valor_aluguel               30 non-null     float64
dtypes: float64(1), object(3)
memory usage: 1.1+ KB

__Desafio - Dados Textuais__

- manipule os textos presentes na coluna Cliente para que seja obtido como resultado os nomes dos clientes em letras minúsculas, com a ausência de caracteres especiais ou números.

In [90]:
# Minusculas
dados_vendas['Cliente'] = dados_vendas['Cliente'].str.lower()

In [91]:
dados_vendas

   Data de venda             Cliente  Valor da compra
0     06/06/2022     @ana _lucia 321           836.50
1     06/06/2022  diego armandiu 210           573.33
2     06/06/2022  diego armandiu 210           392.80
3     06/06/2022  diego armandiu 210           512.34
4     07/06/2022  isabely joanes 738           825.31
5     07/06/2022  isabely joanes 738           168.07
6     07/06/2022  isabely joanes 738           339.18
7     07/06/2022  isabely joanes 738           314.69
8     08/06/2022  isabely joanes 738           682.05
9     08/06/2022    joão gabriel 671           386.34
10    08/06/2022  julya meireles 914           622.65
11    08/06/2022  julya meireles 914           630.79
12    09/06/2022  julya meireles 914           390.30
13    09/06/2022     maria julia 444           759.16
14    09/06/2022     maria julia 444           334.47
15    09/06/2022     maria julia 444           678.78
16    10/06/2022     maria julia 444           314.24
17    10/06/2022     pedro pasco 812           311.15
18    10/06/2022    paulo castro 481           899.16
19    10/06/2022   thiago fritzz 883           885.24

In [92]:
# Remoção de números, e underscore e @
regex_para_numeros: str = r"[0-9]"
dados_vendas['Cliente'] = dados_vendas['Cliente'].str.replace(pat=regex_para_numeros, repl=" ", regex=True)
dados_vendas['Cliente'] = dados_vendas['Cliente'].str.replace(pat="@", repl="")
dados_vendas['Cliente'] = dados_vendas['Cliente'].str.replace(pat="_", repl="").str.strip()

> A solução da Alura foi a seguinte:  

```python
# Tudo que satisfaz o regex é apagado
dados['Cliente'].str.replace('[^a-z ]', '', regex=True)
```

In [93]:
dados_vendas

   Data de venda         Cliente  Valor da compra
0     06/06/2022       ana lucia           836.50
1     06/06/2022  diego armandiu           573.33
2     06/06/2022  diego armandiu           392.80
3     06/06/2022  diego armandiu           512.34
4     07/06/2022  isabely joanes           825.31
5     07/06/2022  isabely joanes           168.07
6     07/06/2022  isabely joanes           339.18
7     07/06/2022  isabely joanes           314.69
8     08/06/2022  isabely joanes           682.05
9     08/06/2022    joão gabriel           386.34
10    08/06/2022  julya meireles           622.65
11    08/06/2022  julya meireles           630.79
12    09/06/2022  julya meireles           390.30
13    09/06/2022     maria julia           759.16
14    09/06/2022     maria julia           334.47
15    09/06/2022     maria julia           678.78
16    10/06/2022     maria julia           314.24
17    10/06/2022     pedro pasco           311.15
18    10/06/2022    paulo castro           899.16
19    10/06/2022   thiago fritzz           885.24

In [94]:
dados_imoveis['apartamento'] = dados_imoveis['apartamento'].str.replace(" (blocoAP)", "").str.strip()

In [95]:
dados_imoveis

   apartamento datas_combinadas_pagamento datas_de_pagamento  valor_aluguel
0         A101                 01/06/2022         05/06/2022         1000.0
1         A101                 01/07/2022         03/07/2022         2500.0
2         A102                 02/06/2022         02/06/2022         1100.0
3         A102                 02/07/2022         06/07/2022         2600.0
4         B201                 03/06/2022         07/06/2022         1200.0
5         B201                 03/07/2022         03/07/2022         2700.0
6         B202                 04/06/2022         07/06/2022         1300.0
7         B202                 04/07/2022         05/07/2022         2800.0
8         C301                 05/06/2022         10/06/2022         1400.0
9         C301                 05/07/2022         09/07/2022         2900.0
10        C302                 06/06/2022         08/06/2022         1500.0
11        C302                 06/07/2022         12/07/2022         1200.0
12        D401                 07/06/2022         07/06/2022         1600.0
13        D401                 07/07/2022         09/07/2022         1300.0
14        D402                 08/06/2022         10/06/2022         1700.0
15        D402                 08/07/2022         14/07/2022         1400.0
16        E501                 09/06/2022         10/06/2022         1800.0
17        E501                 09/07/2022         09/07/2022         1500.0
18        E502                 10/06/2022         16/06/2022         1900.0
19        E502                 10/07/2022         12/07/2022         1600.0
20        F601                 11/06/2022         17/06/2022         2000.0
21        F601                 11/07/2022         13/07/2022         1000.0
22        F602                 12/06/2022         15/06/2022         2100.0
23        F602                 12/07/2022         12/07/2022         1100.0
24        G701                 13/06/2022         19/06/2022         2200.0
25        G701                 13/07/2022         20/07/2022         1200.0
26        G702                 14/06/2022         15/06/2022         2300.0
27        G702                 14/07/2022         17/07/2022         2100.0
28        H801                 15/06/2022         18/06/2022         2400.0
29        H801                 15/07/2022         16/07/2022         2200.0

__Desafio__  

Na coluna Data de venda, temos datas em formato 'dia/mês/ano' (dd/mm/AAAA). Transforme esses dados para o tipo datetime e busque uma forma de visualização de subconjunto que possa contribuir no objetivo do contexto que os dados estão inseridos.

O objetivo desse projeto é realizar uma análise dos resultados de um evento com os clientes de uma empresa de vendas online. Foi coletado um conjunto de dados que contém os clientes que mais gastaram com produtos dentro de 5 dias de vendas, que é o período de duração do evento. Essa análise vai identificar o cliente com a maior compra na semana, que irá receber um prêmio da loja, e posteriormente, ela pode ajudar a empresa a criar novas estratégias para atrair mais clientes.

In [96]:
dados_vendas

   Data de venda         Cliente  Valor da compra
0     06/06/2022       ana lucia           836.50
1     06/06/2022  diego armandiu           573.33
2     06/06/2022  diego armandiu           392.80
3     06/06/2022  diego armandiu           512.34
4     07/06/2022  isabely joanes           825.31
5     07/06/2022  isabely joanes           168.07
6     07/06/2022  isabely joanes           339.18
7     07/06/2022  isabely joanes           314.69
8     08/06/2022  isabely joanes           682.05
9     08/06/2022    joão gabriel           386.34
10    08/06/2022  julya meireles           622.65
11    08/06/2022  julya meireles           630.79
12    09/06/2022  julya meireles           390.30
13    09/06/2022     maria julia           759.16
14    09/06/2022     maria julia           334.47
15    09/06/2022     maria julia           678.78
16    10/06/2022     maria julia           314.24
17    10/06/2022     pedro pasco           311.15
18    10/06/2022    paulo castro           899.16
19    10/06/2022   thiago fritzz           885.24

In [97]:
print(dados_vendas['Data de venda'].unique()) # 5 dias de venda

['06/06/2022' '07/06/2022' '08/06/2022' '09/06/2022' '10/06/2022']

In [98]:
# Conversão a datetime => criação de coluna formatada.
dados_vendas['Data de venda'] = pd.to_datetime(arg=dados_vendas['Data de venda'])

In [99]:
dados_vendas

   Data de venda         Cliente  Valor da compra
0     2022-06-06       ana lucia           836.50
1     2022-06-06  diego armandiu           573.33
2     2022-06-06  diego armandiu           392.80
3     2022-06-06  diego armandiu           512.34
4     2022-07-06  isabely joanes           825.31
5     2022-07-06  isabely joanes           168.07
6     2022-07-06  isabely joanes           339.18
7     2022-07-06  isabely joanes           314.69
8     2022-08-06  isabely joanes           682.05
9     2022-08-06    joão gabriel           386.34
10    2022-08-06  julya meireles           622.65
11    2022-08-06  julya meireles           630.79
12    2022-09-06  julya meireles           390.30
13    2022-09-06     maria julia           759.16
14    2022-09-06     maria julia           334.47
15    2022-09-06     maria julia           678.78
16    2022-10-06     maria julia           314.24
17    2022-10-06     pedro pasco           311.15
18    2022-10-06    paulo castro           899.16
19    2022-10-06   thiago fritzz           885.24

In [100]:
dados_vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     datetime64[ns]
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 612.0+ bytes

In [101]:
# Formatação para datetime em pt-br dd/mm
# dados_vendas['dia/mes'] = 
dados_vendas['Data de venda'] = dados_vendas['Data de venda'].dt.strftime(date_format="%d/%m")

In [102]:
dados_vendas

   Data de venda         Cliente  Valor da compra
0          06/06       ana lucia           836.50
1          06/06  diego armandiu           573.33
2          06/06  diego armandiu           392.80
3          06/06  diego armandiu           512.34
4          06/07  isabely joanes           825.31
5          06/07  isabely joanes           168.07
6          06/07  isabely joanes           339.18
7          06/07  isabely joanes           314.69
8          06/08  isabely joanes           682.05
9          06/08    joão gabriel           386.34
10         06/08  julya meireles           622.65
11         06/08  julya meireles           630.79
12         06/09  julya meireles           390.30
13         06/09     maria julia           759.16
14         06/09     maria julia           334.47
15         06/09     maria julia           678.78
16         06/10     maria julia           314.24
17         06/10     pedro pasco           311.15
18         06/10    paulo castro           899.16
19         06/10   thiago fritzz           885.24

In [117]:
gastos_clientes = dados_vendas.groupby(['Cliente','Data de venda'])[['Valor da compra']].sum()
gastos_clientes

                              Valor da compra
Cliente        Data de venda
ana lucia      06/06                   836.50
diego armandiu 06/06                  1478.47
isabely joanes 06/07                  1647.25
               06/08                   682.05
joão gabriel   06/08                   386.34
julya meireles 06/08                  1253.44
               06/09                   390.30
maria julia    06/09                  1772.41
               06/10                   314.24
paulo castro   06/10                   899.16
pedro pasco    06/10                   311.15
thiago fritzz  06/10                   885.24

In [161]:
gastos_clientes = dados_vendas.groupby(['Cliente','Data de venda'])[['Valor da compra']].sum().unstack()

In [163]:
gastos_clientes.fillna(value=0.0, inplace=True)

In [174]:
tabela = gastos_clientes.T
tabela

Cliente                        ana lucia  diego armandiu  isabely joanes  \
                Data de venda
Valor da compra 06/06              836.5         1478.47            0.00
                06/07                0.0            0.00         1647.25
                06/08                0.0            0.00          682.05
                06/09                0.0            0.00            0.00
                06/10                0.0            0.00            0.00

Cliente                        joão gabriel  julya meireles  maria julia  \
                Data de venda
Valor da compra 06/06                  0.00            0.00         0.00
                06/07                  0.00            0.00         0.00
                06/08                386.34         1253.44         0.00
                06/09                  0.00          390.30      1772.41
                06/10                  0.00            0.00       314.24

Cliente                        paulo castro  pedro pasco  thiago fritzz
                Data de venda
Valor da compra 06/06                  0.00         0.00           0.00
                06/07                  0.00         0.00           0.00
                06/08                  0.00         0.00           0.00
                06/09                  0.00         0.00           0.00
                06/10                899.16       311.15         885.24

In [180]:
tabela.sum()

Cliente
ana lucia          836.50
diego armandiu    1478.47
isabely joanes    2329.30
joão gabriel       386.34
julya meireles    1643.74
maria julia       2086.65
paulo castro       899.16
pedro pasco        311.15
thiago fritzz      885.24
dtype: float64

In [181]:
tabela.sum().idxmax()

'isabely joanes'

Solução da Alura

In [198]:
dados_vendas.groupby('Cliente')[['Valor da compra']].sum()
# mais fácil, mas a minha mostrou os dias :p

                Valor da compra
Cliente
ana lucia                836.50
diego armandiu          1478.47
isabely joanes          2329.30
joão gabriel             386.34
julya meireles          1643.74
maria julia             2086.65
paulo castro             899.16
pedro pasco              311.15
thiago fritzz            885.24

<h4 style="color:green;">Desafio de tratamento de dados com o objetivo de analisar o atraso no pagamento de aluguéis no condomínio fictício de alguns moradores.</h4>


Nas colunas datas_de_pagamento e datas_combinadas_pagamento, temos datas em formato 'dia/mês/ano' (dd/mm/AAAA). Transforme esses dados para o tipo datetime e busque uma forma de visualização de subconjunto que possa contribuir no objetivo do contexto que os dados estão inseridos.

In [185]:
dados_imoveis.head()

  apartamento datas_combinadas_pagamento datas_de_pagamento  valor_aluguel
0        A101                 01/06/2022         05/06/2022         1000.0
1        A101                 01/07/2022         03/07/2022         2500.0
2        A102                 02/06/2022         02/06/2022         1100.0
3        A102                 02/07/2022         06/07/2022         2600.0
4        B201                 03/06/2022         07/06/2022         1200.0

In [200]:
dados_imoveis['datas_combinadas_pagamento'] = pd.to_datetime(dados_imoveis['datas_combinadas_pagamento'], format="%d/%m/%Y")
dados_imoveis['datas_de_pagamento'] = pd.to_datetime(dados_imoveis['datas_de_pagamento'], format="%d/%m/%Y")

In [201]:
dados_imoveis.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   apartamento                 30 non-null     object
 1   datas_combinadas_pagamento  30 non-null     datetime64[ns]
 2   datas_de_pagamento          30 non-null     datetime64[ns]
 3   valor_aluguel               30 non-null     float64
dtypes: datetime64[ns](2), float64(1), object(1)
memory usage: 1.1+ KB

In [210]:
dados_imoveis

   apartamento datas_combinadas_pagamento datas_de_pagamento  valor_aluguel
0         A101                 2022-06-01         2022-06-05         1000.0
1         A101                 2022-07-01         2022-07-03         2500.0
2         A102                 2022-06-02         2022-06-02         1100.0
3         A102                 2022-07-02         2022-07-06         2600.0
4         B201                 2022-06-03         2022-06-07         1200.0
5         B201                 2022-07-03         2022-07-03         2700.0
6         B202                 2022-06-04         2022-06-07         1300.0
7         B202                 2022-07-04         2022-07-05         2800.0
8         C301                 2022-06-05         2022-06-10         1400.0
9         C301                 2022-07-05         2022-07-09         2900.0
10        C302                 2022-06-06         2022-06-08         1500.0
11        C302                 2022-07-06         2022-07-12         1200.0
12        D401                 2022-06-07         2022-06-07         1600.0
13        D401                 2022-07-07         2022-07-09         1300.0
14        D402                 2022-06-08         2022-06-10         1700.0
15        D402                 2022-07-08         2022-07-14         1400.0
16        E501                 2022-06-09         2022-06-10         1800.0
17        E501                 2022-07-09         2022-07-09         1500.0
18        E502                 2022-06-10         2022-06-16         1900.0
19        E502                 2022-07-10         2022-07-12         1600.0
20        F601                 2022-06-11         2022-06-17         2000.0
21        F601                 2022-07-11         2022-07-13         1000.0
22        F602                 2022-06-12         2022-06-15         2100.0
23        F602                 2022-07-12         2022-07-12         1100.0
24        G701                 2022-06-13         2022-06-19         2200.0
25        G701                 2022-07-13         2022-07-20         1200.0
26        G702                 2022-06-14         2022-06-15         2300.0
27        G702                 2022-07-14         2022-07-17         2100.0
28        H801                 2022-06-15         2022-06-18         2400.0
29        H801                 2022-07-15         2022-07-16         2200.0

In [213]:
dados_imoveis['atraso'] = dados_imoveis['datas_de_pagamento'] - dados_imoveis['datas_combinadas_pagamento']

In [214]:
dados_imoveis

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel,atraso
0,A101,2022-06-01,2022-06-05,1000.0,4 days
1,A101,2022-07-01,2022-07-03,2500.0,2 days
2,A102,2022-06-02,2022-06-02,1100.0,0 days
3,A102,2022-07-02,2022-07-06,2600.0,4 days
4,B201,2022-06-03,2022-06-07,1200.0,4 days
5,B201,2022-07-03,2022-07-03,2700.0,0 days
6,B202,2022-06-04,2022-06-07,1300.0,3 days
7,B202,2022-07-04,2022-07-05,2800.0,1 days
8,C301,2022-06-05,2022-06-10,1400.0,5 days
9,C301,2022-07-05,2022-07-09,2900.0,4 days
10,C302,2022-06-06,2022-06-08,1500.0,2 days
11,C302,2022-07-06,2022-07-12,1200.0,6 days
12,D401,2022-06-07,2022-06-07,1600.0,0 days
13,D401,2022-07-07,2022-07-09,1300.0,2 days
14,D402,2022-06-08,2022-06-10,1700.0,2 days
15,D402,2022-07-08,2022-07-14,1400.0,6 days
16,E501,2022-06-09,2022-06-10,1800.0,1 days
17,E501,2022-07-09,2022-07-09,1500.0,0 days
18,E502,2022-06-10,2022-06-16,1900.0,6 days
19,E502,2022-07-10,2022-07-12,1600.0,2 days
20,F601,2022-06-11,2022-06-17,2000.0,6 days
21,F601,2022-07-11,2022-07-13,1000.0,2 days
22,F602,2022-06-12,2022-06-15,2100.0,3 days
23,F602,2022-07-12,2022-07-12,1100.0,0 days
24,G701,2022-06-13,2022-06-19,2200.0,6 days
25,G701,2022-07-13,2022-07-20,1200.0,7 days
26,G702,2022-06-14,2022-06-15,2300.0,1 days
27,G702,2022-07-14,2022-07-17,2100.0,3 days
28,H801,2022-06-15,2022-06-18,2400.0,3 days
29,H801,2022-07-15,2022-07-16,2200.0,1 days

In [220]:
dados_imoveis['Mês'] = dados_imoveis['datas_combinadas_pagamento'].dt.month
dados_imoveis

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel,atraso,Mês
0,A101,2022-06-01,2022-06-05,1000.0,4 days,6
1,A101,2022-07-01,2022-07-03,2500.0,2 days,7
2,A102,2022-06-02,2022-06-02,1100.0,0 days,6
3,A102,2022-07-02,2022-07-06,2600.0,4 days,7
4,B201,2022-06-03,2022-06-07,1200.0,4 days,6
5,B201,2022-07-03,2022-07-03,2700.0,0 days,7
6,B202,2022-06-04,2022-06-07,1300.0,3 days,6
7,B202,2022-07-04,2022-07-05,2800.0,1 days,7
8,C301,2022-06-05,2022-06-10,1400.0,5 days,6
9,C301,2022-07-05,2022-07-09,2900.0,4 days,7
10,C302,2022-06-06,2022-06-08,1500.0,2 days,6
11,C302,2022-07-06,2022-07-12,1200.0,6 days,7
12,D401,2022-06-07,2022-06-07,1600.0,0 days,6
13,D401,2022-07-07,2022-07-09,1300.0,2 days,7
14,D402,2022-06-08,2022-06-10,1700.0,2 days,6
15,D402,2022-07-08,2022-07-14,1400.0,6 days,7
16,E501,2022-06-09,2022-06-10,1800.0,1 days,6
17,E501,2022-07-09,2022-07-09,1500.0,0 days,7
18,E502,2022-06-10,2022-06-16,1900.0,6 days,6
19,E502,2022-07-10,2022-07-12,1600.0,2 days,7
20,F601,2022-06-11,2022-06-17,2000.0,6 days,6
21,F601,2022-07-11,2022-07-13,1000.0,2 days,7
22,F602,2022-06-12,2022-06-15,2100.0,3 days,6
23,F602,2022-07-12,2022-07-12,1100.0,0 days,7
24,G701,2022-06-13,2022-06-19,2200.0,6 days,6
25,G701,2022-07-13,2022-07-20,1200.0,7 days,7
26,G702,2022-06-14,2022-06-15,2300.0,1 days,6
27,G702,2022-07-14,2022-07-17,2100.0,3 days,7
28,H801,2022-06-15,2022-06-18,2400.0,3 days,6
29,H801,2022-07-15,2022-07-16,2200.0,1 days,7

In [238]:
# Média de dias de atraso
dados_imoveis.groupby(['apartamento'])[['atraso']].mean()

                     atraso
apartamento
A101        3 days 00:00:00
A102        2 days 00:00:00
B201        2 days 00:00:00
B202        2 days 00:00:00
C301        4 days 12:00:00
C302        4 days 00:00:00
D401        1 days 00:00:00
D402        4 days 00:00:00
E501        0 days 12:00:00
E502        4 days 00:00:00
F601        4 days 00:00:00
F602        1 days 12:00:00
G701        6 days 12:00:00
G702        2 days 00:00:00
H801        2 days 00:00:00